# All lines starting with #! may be eventually stripped on user preference

# Output Directory
set outputDir vivado_out/
file mkdir $outputDir

# Design Sources and Constraints
set src examples/vhdl_fifo_memory
set xdcFile xdc/constraint.xdc
read_vhdl -library bftLib [ glob $src]
read_verilog [ glob $src]
read_xdc $xdcFile

# Run synthesis and write checkpoint
#! read_checkpoint -incremental $outputDir/post_synth.dcp ;# to be turned on for incremental runs (#! is stripped eventually)
synth_design -top box -part xc7k70tfbv676-1 -directive RuntimeOptimized
write_checkpoint -incremental_synth -force $outputDir/post_synth.dcp ;# either -incremental_synth or nothing

report_timing -no_header -file $outputDir/post_synth_setup_timing.rpt ;# -setup is default behavior
report_utilization -no_primitives -omit_locs -format xml -file $outputDir/post_synth_util.xml
